/*
 * Напиши скрипт підрахунку суми покупки з знижкою в залежності
 * від витраченої суми за весь час (партнерська програма).
 *
 * - Загальна сума витрачених коштів зберігається в змінній totalSpent
 * - Сума поточного платежу зберігається в змінній payment
 * - Знижка зберігається в змінній discount
 *
 * - Якщо витрачено від [100 до 1000) - бронзовий партенр, знижка 2%
 * - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
 * - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
 * - Якщо витрачено менше 100) - не партнер, знижка 0%
 *
 * - В результаті вивести повідомлення
 * Оформляємо замовлення ана суму [сума] з знижкою [знижка]%»
 */


let totalSpent = 2000;
let payment = 50000;
let discount = 0;

if(totalSpent < 100) {
  console.log(`Оформляємо замовлення на суму ${payment} з знижкою ${discount}%`);
}else if (totalSpent >= 1000 && totalSpent < 1000){
    console.log(`Оформляємо замовлення на суму ${payment} з знижкою 2%`, );
    discount = 0.02;
}else if (totalSpent >= 1000 && totalSpent < 5000){
    console.log(`Оформляємо замовлення на суму ${payment} з знижкою 5%`, );
    discount = 0.05;
}else if (totalSpent >= 5000){
    console.log(`Оформляємо замовлення на суму ${payment} з знижкою 10%`, );
    discount = 0.10;
}
payment -= payment * discount;
console.log(`До оплати - ${payment}`);
totalSpent += payment;
console.log(`загальний рахунок покупки ${totalSpent}`);